In [3]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt 
%matplotlib inline

In [4]:
data = pd.read_excel('datasets/Gyeongbu_HSR.xlsx')
data

,Train,Number,Departure Time,Arrival Time,Travel Time (Hours),Additional Information
0,KTX,1,05:13:00,07:49:00,02:36:00,NaN
1,KTX,3,05:28:00,08:15:00,02:47:00,NaN
2,KTX,5,05:58:00,08:42:00,02:44:00,Seodaegu
3,KTX-Sancheon,75,06:03:00,08:48:00,02:45:00,NaN
4,KTX,7,06:33:00,09:21:00,02:48:00,NaN
...,...,...,...,...,...,...
61,KTX-Sancheon,9195,21:33:00,00:09:00,02:36:00,NaN
62,KTX,111,21:38:00,00:47:00,03:09:00,"Seodaegu, Gupo"
63,KTX,71,21:58:00,00:42:00,02:44:00,Seodaegu
64,KTX,73,22:28:00,01:03:00,02:35:00,NaN
65,KTX,97,22:49:00,01:11:00,02:22:00,NaN

In [5]:
def convert_to_hours(time_obj):
    # Extract hours and minutes
    hours = time_obj.hour
    minutes = time_obj.minute
    # Convert to total hours
    total_hours = hours + minutes / 60.0
    return round(total_hours,2)

In [6]:
# Apply the conversion function to the 'Travel Time' column and create a new column for hours
data['Travel Time (Hours)'] = data['Travel Time (Hours)'].apply(convert_to_hours)

In [7]:
data

,Train,Number,Departure Time,Arrival Time,Travel Time (Hours),Additional Information
0,KTX,1,05:13:00,07:49:00,2.60,NaN
1,KTX,3,05:28:00,08:15:00,2.78,NaN
2,KTX,5,05:58:00,08:42:00,2.73,Seodaegu
3,KTX-Sancheon,75,06:03:00,08:48:00,2.75,NaN
4,KTX,7,06:33:00,09:21:00,2.80,NaN
...,...,...,...,...,...,...
61,KTX-Sancheon,9195,21:33:00,00:09:00,2.60,NaN
62,KTX,111,21:38:00,00:47:00,3.15,"Seodaegu, Gupo"
63,KTX,71,21:58:00,00:42:00,2.73,Seodaegu
64,KTX,73,22:28:00,01:03:00,2.58,NaN
65,KTX,97,22:49:00,01:11:00,2.37,NaN